modules/shared/config/emacs/config.org
#+TITLE: Emacs
#+STARTUP: content
#+PROPERTY: header-args :results silent
#+PROPERTY: header-args:emacs-lisp :lexical t

* Configuration   :emacs:
** About my Emacs
This is my detailed Emacs configuration. It's an ~org~ file that is transpiled to ~emacs-lisp~ as part of the Nix build process. 

Why an org file? My Emacs config is large, and this enables me to greatly improve readability of its documentation. I edit this file the same way you're reading it (nicely formatted) as I use Emacs and Emacs speaks org. Sounds complicated, but it's really not; [[https://github.com/dustinlyons/nixos-config/blob/main/nixos/default.nix#L215][just a few lines]] in my Nix config. [[https://github.com/dustinlyons/nixos-config/blob/main/darwin/default.nix#L28][MacOS too.]]

This is the main configuration, but there also exists one more init file, ~init.el~ , that bootstraps ~org-mode~ before this file is interpreted. That's defined [[https://github.com/dustinlyons/nixos-config/blob/main/shared/files.nix#L5][here]].

/Each block of code below is the actual Emacs configuration./ Formally, this style of configuration is named [[https://en.wikipedia.org/wiki/Literate_programming]["literate programming"]].

** Personal Information
Just me!

#+NAME: personal-info
#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Alán F. Muñoz"
    user-mail-address "alan@quasimorphic.com")
#+END_SRC

*** System-side functions
Convenience functions to find my config files locally or remotely. 
#+begin_src emacs-lisp
  (setq config-files-by-priority (list org-config-file default-config-file default-config-url))

  (defun config-file-exists-p (file)
    (or (file-exists-p file)
        (and (string-match-p "\\`https?://" file)
             (require 'url-handlers nil t)
             (url-file-exists-p file))))

  (defun find-config-dir (config-files)
    (seq-find #'config-file-exists-p config-files))

  (setq config-dir (file-name-directory (find-config-dir config-files-by-priority)))
#+end_src

** Initialization
*** Booting up
Mainly splash screen settings. In the future we may look to optimize performance here.

#+NAME: startup
#+BEGIN_SRC emacs-lisp
  ;; Turn off the splash screenu
  (setq inhibit-startup-screen t)
  ;; Turn off the splash screen
  (setq initial-scratch-message nil)
  #+END_SRC
  
*** Add package sources
This associates our package manager with the right source (MELPA).

#+NAME: package-sources
#+BEGIN_SRC emacs-lisp
  (unless (assoc-default "melpa" package-archives)
    (add-to-list 'package-archives '("melpa" . "https://melpa.org/packages/") t))
  (unless (assoc-default "nongnu" package-archives)
    (add-to-list 'package-archives '("nongnu" . "https://elpa.nongnu.org/nongnu/") t))
#+END_SRC

*** System Definitions
**** Conditionals

#+BEGIN_SRC emacs-lisp
  (defun system-is-mac ()
    "Return true if system is darwin-based (Mac OS X)"
    (string-equal system-type "darwin"))

  (defun system-is-linux ()
    "Return true if system is GNU/Linux-based"
    (string-equal system-type "gnu/linux"))

  ;; PATH and exec-path are set by exec-path-from-shell in init.el.
#+END_SRC

*** Modes

This is used primarily to center org mode text.
#+NAME: mode-margins
#+BEGIN_SRC emacs-lisp
  (defun dl/org-mode-visual-fill ()
    (setq visual-fill-column-width 110
        visual-fill-column-center-text t))

  (use-package visual-fill-column
    :defer t
    :hook (org-mode . dl/org-mode-visual-fill))
#+END_SRC

*** Focus the window when running emacsclient
#+begin_src emacs-lisp
  (add-hook 'server-switch-hook #'raise-frame)
#+end_src

** Global Settings
*** Global Modes
Generally-useful modes

#+NAME: global-modes
#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p) ;; Use Y or N in prompts, instead of full Yes or No

  (setq
   display-line-numbers-current-absolute t
   display-line-numbers-type 'visual
   )
  (global-visual-line-mode t) ;; Wraps lines everywhere
  (global-auto-revert-mode t) ;; Auto refresh buffers from disk
  (global-display-line-numbers-mode t)
  (line-number-mode t) ;; Line numbers in the gutter

  (electric-pair-mode 1)
  (show-paren-mode t) ;; Highlights parens

  ;; The built-in `recentf-mode' keeps track of recently visited files.
  ;; You can then access those through the `consult-buffer' interface or
  ;; with `recentf-open'/`recentf-open-files'.
  ;;
  ;; I do not use this facility, because the files I care about are
  ;; either in projects or are bookmarked.
  (recentf-mode 1)

  (setq warning-minimum-level :error)

  ;; Use TAB in place of C-M-i for completion-at-point
  (setq tab-always-indent 'complete)
  (setq completion-styles '(orderless flex basic partial-completion emacs22))
#+END_SRC

*** General Shortcuts
I use ~general.el~ to define groups of keybindings under my 'leader' definition. You will see these definitions sprinkled throughout this file; they are just quick shortcuts. For more info, [[https://medium.com/usevim/vim-101-what-is-the-leader-key-f2f5c1fa610f][here]] is a good explanation on leader keys.

#+NAME: keybindings
#+BEGIN_SRC emacs-lisp
  ;; ESC will also cancel/quit/etc.
  (global-set-key (kbd "<escape>") 'keyboard-escape-quit)
  (global-set-key (kbd "C-=") 'text-scale-increase)
  (global-set-key (kbd "C--") 'text-scale-decrease)
#+END_SRC

*** Share clipboard in remote sessions or terminal
Clipetty works well for macOS
#+begin_src emacs-lisp
  (unless window-system
    (xterm-mouse-mode 1))

; TODO Check if this is actually working
  (use-package clipetty
    :config
    (global-clipetty-mode 1))
#+end_src

I needed this for it to work on Linux-Linux connections. [[https://www.rahuljuliato.com/posts/emacs-clipboard-terminal][source]].
#+begin_src emacs-elisp
  (setq xterm-extra-capabilities '(getSelection setSelection modifyOtherKeys))
#+end_src

*** Navigation, views and editing
**** Meow modal editing

#+begin_src emacs-lisp
  (use-package meow
    :config
    (defun meow-setup ()
      ;; -------------------- ;;
      ;;         UTILS        ;;
      ;; -------------------- ;;
      (defun meow-word ()
        "Expand word/symbol under cursor."
        (interactive)
        (if (and (use-region-p)
                 (equal (car (region-bounds))
  		      (bounds-of-thing-at-point 'word)))
            (meow-mark-symbol 1)
          (progn
            (when (and (mark)
                       (equal (car (region-bounds))
                              (bounds-of-thing-at-point 'symbol)))
              (meow-pop-selection))
            (meow-mark-word 1))))

      (defun meow-kill-line ()
        "Kill till the end of line."
        (interactive)
        (let ((select-enable-clipboard meow-use-clipboard))
          (kill-line)))

      (defun meow-change-line ()
        "Kill till end of line and switch to INSERT state."
        (interactive)
        (meow--cancel-selection)
        (meow-end-of-thing
         (car (rassoc 'line meow-char-thing-table)))
        (meow-change))

      (defun meow-save-clipboard ()
        "Copy in clipboard."
        (interactive)
        (let ((meow-use-clipboard t))
          (meow-save)))

      (defvar meow--trim-yank nil)

      (defun meow-insert-for-yank-advice (orig-fn str)
        "Advice for `insert-for-yank' function to correctly insert lines."
        (when meow--trim-yank
          (set 'str (string-trim-right str "\n")))
        (if (and (not (eq (point) (+ 1 (line-end-position 0))))
                 (string-match-p "^.+\n$" str))
            (save-excursion
              (beginning-of-line)
              (funcall orig-fn str))
          (funcall orig-fn str)))

      (defun meow-yank-dwim ()
        "Smart yank."
        (interactive)
        (advice-add 'insert-for-yank :around 'meow-insert-for-yank-advice)
        (if (use-region-p)
            (let ((meow--trim-yank t))
              (delete-region (region-beginning) (region-end))
              (meow-yank))
          (meow-yank))
        (advice-remove 'insert-for-yank 'meow-insert-for-yank-advice))

      (defun meow-yank-pop-dwim ()
        "Smart yank pop."
        (interactive)
        (advice-add 'insert-for-yank :around 'meow-insert-for-yank-advice)
        (if (use-region-p)
            (let ((meow--trim-yank t))
              (delete-region (region-beginning) (region-end))
              (meow-yank-pop))
          (meow-yank-pop))
        (advice-remove 'insert-for-yank 'meow-insert-for-yank-advice))

      (defun meow-smart-reverse ()
        "Reverse selection or begin negative argument."
        (interactive)
        (if (use-region-p)
            (meow-reverse)
          (negative-argument nil)))

      (defun meow-kmacro ()
        "Toggle recording of kmacro."
        (interactive)
        (if defining-kbd-macro
            (kmacro-end-kmacro)
          (kmacro-start-macro)))

      (defun meow-eldoc ()
        "Toggle the display of the eldoc window."
        (interactive)
        (if (get-buffer-window eldoc--doc-buffer)
            (delete-window (get-buffer-window eldoc--doc-buffer))
          (eldoc-doc-buffer t)))

      ;; -------------------- ;;
      ;;       VARIABLES      ;;
      ;; -------------------- ;;
      (meow-thing-register 'angle
                           '(pair ("<") (">"))
                           '(pair ("<") (">")))

      (setq meow-char-thing-table
            '((?f . round)
              (?d . square)
              (?s . curly)
              (?a . angle)
              (?r . string)
              (?v . paragraph)
              (?c . line)
              (?x . buffer)))

      (setq meow-selection-command-fallback
            '((meow-change . meow-change-char)
              ;; (meow-kill . meow-delete)
              (meow-cancel-selection . keyboard-quit)
              (meow-pop-selection . meow-pop-grab)
              (meow-beacon-change . meow-beacon-change-char)))

      ;; -------------------- ;;
      ;;       MAPPINGS       ;;
      ;; -------------------- ;;
      (meow-define-keys 'normal
  					; expansion
        '("0" . meow-expand-0)
        '("1" . meow-expand-1)
        '("2" . meow-expand-2)
        '("3" . meow-expand-3)
        '("4" . meow-expand-4)
        '("5" . meow-expand-5)
        '("6" . meow-expand-6)
        '("7" . meow-expand-7)
        '("8" . meow-expand-8)
        '("9" . meow-expand-9)
        '("'" . meow-smart-reverse)

  					; movement
        '("i" . meow-prev)
        '("k" . meow-next)
        '("j" . meow-left)
        '("l" . meow-right)

        '("y" . meow-search)
        ;; '("/" . meow-visit)
        '("/" . consult-line)

  					; expansion
        '("I" . meow-prev-expand)
        '("K" . meow-next-expand)
        '("J" . meow-left-expand)
        '("L" . meow-right-expand)

        '("u" . meow-back-word)
        '("U" . meow-back-symbol)
        '("o" . meow-next-word)
        '("O" . meow-next-symbol)

        '("a" . meow-word)
        '("s" . meow-line)
        '("w" . meow-block)
        '("q" . meow-join)
        '("g" . meow-grab)
        '("G" . meow-pop-grab)
        '("p" . meow-cancel-selection)
        '("P" . meow-pop-selection)

        '("x" . meow-till)
        '("X" . meow-find)

        '("," . meow-beginning-of-thing)
        '("." . meow-end-of-thing)
        '("<" . meow-inner-of-thing)
        '(">" . meow-bounds-of-thing)

        '("[" . indent-rigidly-left-to-tab-stop)
        '("]" . indent-rigidly-right-to-tab-stop)

  					; editing
        '("b" . open-line)
        '("B" . split-line)
        '("d" . meow-kill)
        '("D" . meow-kill-line)
        '("f" . meow-change)
        '("F" . meow-change-line)
        '("c" . meow-save)
        '("C" . meow-save-clipboard)
        '("v" . meow-yank-dwim)
        '("V" . meow-yank-pop-dwim)

        '("e" . meow-insert)
        '("E" . meow-open-above)
        '("r" . meow-append)
        '("R" . meow-open-below)

        '("z" . query-replace-regexp)

        
        ;; '("h" . undo-tree-undo)
        ;; '("H" . undo-tree-redo)
        '("h" . undo)
        '("H" . undo-redo)

        '("m"  . meow-kmacro)
        '("M"  . kmacro-call-macro)
        '("nm" . kmacro-edit-macro) ;; 'n' prefix is for editing commands

        '("nf" . meow-comment)

        '("N"  . upcase-dwim)
        '("nn" . downcase-dwim)
        '("nN" . capitalize-dwim)

        '("ns" . meow-swap-grab)
        
  					; External packages
        '("nr" . surround-insert)
        
  					; eldoc
        '("t" . eldoc-box-help-at-point)
        '("T" . meow-eldoc)

  					; general
        '(";F" . save-some-buffers)
        '(";g" . goto-last-change)
        '("Q" . meow-quit)
        '(";c" . duplicate-dwim)
        '(";C" . copy-and-comment-region)
        '(";fr" . recentf)
        '(";hq" . restart-emacs)
        '(";hr" . dl/reload-emacs)
        '(";hn" . dl/load-buffer-with-nix-config)
        '(";hp" . dl/load-buffer-with-emacs-config)
        '(";ot" . toggle-eat-window)
        '(";oT" . +eat/here)
        '(";ox" . afm/toggle-scratch-buffer)
        '(";lf" . dl/xref-find-references-other-window)
        '(";lc" . dl/xref-find-implementation-other-window)
        '(";ls" . consult-imenu) ;; Eglot uses standard imenu
        '(";le" . consult-flymake) ;; Eglot uses flymake, not flycheck
        '(";lh" . eglot-find-typeDefinition)
        '(";lF" . eglot-format-buffer)
        '(";li" . eglot-code-action-organize-imports)
        '(";ll" . eglot)
        '(";lr" . eglot-rename)
        '(";ld" . dl/xref-find-definition-other-window)
        ;; '(";lf" . dl/lsp-find-references-other-window)
        ;; '(";lc" . dl/lsp-find-implementation-other-window)
        ;; '(";ls" . lsp-treemacs-symbols)
        ;; '(";le" . list-flycheck-errors)
        ;; '(";lh" . lsp-treemacs-call-hierarchy)
        ;; '(";lF" . lsp-format-buffer)
        ;; '(";li" . lsp-organize-imports)
        ;; '(";ll" . lsp)
        ;; '(";lr" . lsp-rename)
        ;; '(";ld" . dl/lsp-find-definition-other-window)
        '(";lt" . org-toggle-link-display)
        '(";," . dl/insert-header)
        '(";<" . dl/insert-current-time)
        '(";>" . dl/insert-current-date-prompt)
        '(";b" . bufler-switch-buffer)
        '(";B" . bufler-list)
        '(";k" . yank-from-kill-ring)

        ;; Rotation
        '(";rw" . rotate-window)
        '(";rl" . rotate-layout)

        ;; Version control
        '(";tg" . git-timemachine-toggle)
        
        ;; Python
        '(";sr" . python-shell-send-region-or-line)
        '(";sb" . python-shell-send-buffer)
        '(";sd" . python-shell-send-defun)
        '(";sq" . python-shell-restart)
        '(";sQ" . python-shell-quit)
        '(";se" . code-cells-eval)
        '(";y" . realgud)
        
        '("<escape>" . ignore)		; ignore escape
        
        ;; version control
        '(";v" . +vc/link-commit)
        '(";V" . +vc/link)

        ;; gptel
        '(";dr" . gptel-rewrite)
        '(";da" . gptel-add)
        '(";dq" . gptel-context-remove-all)

        ;; Agent-shell
        '(";as" . agent-shell)

        ;; popper ;; TODO figure this one out
        '(";q" . popper-toggle)
        '(";Q" . popper-cycle)
        '(";w" . popper-toggle-type)
        ))

    ;; Share the `;' leader with motion state so magit / dired / dashboard
    ;; (which meow puts in motion state) get the same global commands.
    (define-key meow-motion-state-keymap (kbd ";")
                (lookup-key meow-normal-state-keymap ";"))
    ;; End of keybindings
    
    (setq meow-use-cursor-position-hack t
      	meow-use-enhanced-selection-effect t) 
    

    
    '("<escape>" . ignore)) ; ignore escape

      (setq meow-use-cursor-position-hack t
      	meow-use-enhanced-selection-effect t) 

      (meow-setup)
      (meow-global-mode 1)
#+end_src

