modules/shared/config/emacs/config.org
**** Leader key shortcuts
#+NAME::org-mode-quick-entry
#+BEGIN_SRC emacs-lisp
    (defvar current-time-format "%H:%M:%S"
      "Format of date to insert with `insert-current-time' func.
                    Note the weekly scope of the command's precision.")

    (defun dl/load-buffer-with-emacs-config ()
      "Open the emacs configuration"
      (interactive)
      (find-file (if (boundp 'org-config-file) org-config-file "~/.local/share/src/nixos-config/modules/shared/config/emacs/config.org" )))

    (defun dl/load-buffer-with-nix-config ()
      "Open the emacs configuration"
      (interactive)
      (find-file "~/.local/share/src/nixos-config/modules/shared/home-manager.nix"))

    (defun dl/reload-emacs ()
      "Reload the emacs configuration"
      (interactive)
      (load "~/.emacs.d/init.el"))

    (defun dl/insert-header ()
      "Insert a header indented one level from the current header, unless the current header is a timestamp."
      (interactive)
      (let* ((level (org-current-level))
             (headline (org-get-heading t t t t))
             (next-level (if (string-match "^\\([0-9]\\{2\\}:[0-9]\\{2\\}:[0-9]\\{2\\}\\)" headline)
                             (1+ level)
                           level)))
        (end-of-line)
        (newline)
        (insert (make-string next-level ?*))
        (insert " ")))

    (defun dl/insert-current-time ()
      "Insert the current time into the current buffer, at a level one deeper than the current heading."
      (interactive)
      (let* ((level (org-current-level))
             (next-level (1+ level)))
        (end-of-line)
        (newline)
        (insert (make-string next-level ?*))
        (insert " " (format-time-string "%H:%M:%S" (current-time)) "\n")))

    (defun dl/insert-current-date-prompt ()
      "Prompt a calendar and insert the current date into the current buffer, at a level one deeper than the current heading."
      (interactive)
      (let* ((level (org-current-level))
             (next-level (1+ level)))
        (end-of-line)
        (newline)
        (insert (make-string next-level ?*))
        (insert " ")
        (org-time-stamp nil)))

  (defun afm/toggle-window-bottom (buffer-name fn-create-buffer)
    (let ((buffer-window (get-buffer-window buffer-name)))
      (if buffer-window
          (delete-window buffer-window)
        (pop-to-buffer (or (get-buffer buffer-name)
                           (funcall fn-create-buffer))
                       '((display-buffer-at-bottom)
  		       (window-height . 0.4))))))

    (defun afm/toggle-scratch-buffer ()
      (interactive)
      (afm/toggle-window-bottom "*scratch*" 'get-scratch-buffer-create))

#+end_src
  
***** Roam capture templates
These are templates used to create new notes.

#+NAME::roam-templates
#+BEGIN_SRC emacs-lisp
  (setq org-roam-capture-templates
   '(("d" "default" plain
      "%?"
      :if-new (file+head "%<%Y%m%d%H%M%S>-${slug}.org" "#+title: ${title}\n\n")
      :unnarrowed t)))
#+END_SRC

*** Exports
:PROPERTIES:
:header-args:emacs-lisp: :tangle org-export-init.el
:END:
#+begin_src emacs-lisp :tangle no
  (setq org-export-in-background nil)
  ;; Use a minimal init for async export to avoid package conflicts (e.g. org-transclusion)
  (setq org-export-async-init-file (expand-file-name "~/.local/share/src/nixos-config/modules/shared/config/emacs/org-export-init.el"))
#+end_src

**** ox-extra
#+begin_src emacs-lisp
    (use-package org-contrib
    :config
    (require 'ox-extra)
    (ox-extras-activate '(ignore-headlines)))
#+end_src

**** Markdown
#+begin_src emacs-lisp :tangle config.el
  (use-package ox-pandoc
    :ensure t   ;Auto-install the package from Melpa
    :pin melpa  ;`package-archives' should already have ("melpa" . "https://melpa.org/packages/")
    :after org)

   ; Git-flavoured markdown
   (use-package ox-gfm
     :ensure t
     :after org
     :config
     (add-to-list 'org-export-backends 'md )
     (add-to-list 'org-export-backends 'gfm )
  )
#+end_src

**** Hugo
#+begin_src emacs-lisp
  (use-package ox-hugo
    :ensure t   ;Auto-install the package from Melpa
    :pin melpa  ;`package-archives' should already have ("melpa" . "https://melpa.org/packages/")
    :after org
    )
#+end_src

**** Latex/Beamer

#+begin_src emacs-lisp
  (defun org/parse-headings (backend)
    (if (member backend '(latex))
        (org-map-entries
         (lambda ()
           (progn
             (insert-string "#+LATEX: \\newpage")))

         "+newpage")))

  (add-hook 'org-export-before-parsing-hook 'org/parse-headings)
#+end_src

Make use of extarticle by default
#+begin_src emacs-lisp
(setq org-latex-default-class "extarticle")
#+end_src

Captions and cdlatex
#+begin_src emacs-lisp
     (setq org-latex-prefer-user-labels t
           org-latex-caption-above nil
           ;; org-latex-listings 'minted
           org-latex-listings nil
           )


     ;;Colours
  (add-to-list 'org-latex-packages-alist '("" "minted" nil))
  (setq org-latex-minted-options nil)
        ;; '(
        ;; 				 ("frame" "leftline")
        ;; 				 ("lineos" "true")
        ;; 				 ))
  (setq org-latex-src-block-backend 'minted)
   ;; (add-to-list 'org-latex-packages-alist '("" "minted"))
   ;(add-to-list 'org-latex-packages-alist '("" "tabularx"))
   ;(plist-put org-format-latex-options :scale 1.75        )
   ;(add-to-list 'org-latex-packages-alist '("" "unicode-math")))
    (add-to-list 'org-latex-classes
          '("beamerposter"
            "\\documentclass[final]{beamer}
            \\usepackage[T1]{fontenc}
            \\usepackage{lmodern}
            \\usepackage[size=custom,width=84.1,height=118.9,scale=1.0]{beamerposter}
            \\usepackage{graphicx}
            \\usepackage{booktabs}
            \\usepackage{tikz}
            \\usepackage{pgfplots}
            \\pgfplotsset{compat=1.18}
            \\usepackage{anyfontsize}
            [NO-DEFAULT-PACKAGES]"))
  (add-to-list 'org-latex-classes
          '("extarticle"
                  "\\documentclass{extarticle}"
                  ("\\section{%s}" . "\\section*{%s}")
                  ("\\subsection{%s}" . "\\subsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsection*{%s}")))
  (add-to-list 'org-latex-classes
          '("article-minimal"
                  "\\documentclass{article}
                   [NO-DEFAULT-PACKAGES]"
                  ("\\section{%s}" . "\\subsection*{%s}")
                  ("\\subsection{%s}" . "\\subsubsection*{%s}")
                  ("\\subsubsection{%s}" . "\\subsubsubsection*{%s}")))
#+end_src

Set XeLaTex as our compiler
#+begin_src emacs-lisp
(setq org-latex-compiler "xelatex")
#+end_src

Open new windows (such as exported PDF's in a new window)
#+begin_src emacs-lisp
;; Custom latex->PDF conversion
  ;; (setq org-latex-pdf-process
  ;;       '("latexmk -pdflatex='pdflatex -interaction nonstopmode' -shell-escape -pdf -bibtex --synctex=1 -f %f"))
  ;; (setq org-latex-pdf-process
  ;;       '("latexmk -pdflatex='lualatex -interaction nonstopmode' -shell-escape -pdf -bibtex --synctex=1 -f %f"))
  (setq latex-run-command "xelatex")
  (setq org-latex-pdf-process
        '("latexmk -pdflatex='xelatex -shell-escape -interaction nonstopmode ' -shell-escape -pdf -f %f "
          ;; "makeglossaries %
          ;; "biber %b"
          ;; "makeindex %b"
          "latexmk -pdflatex='xelatex -interaction -shell-escape nonstopmode ' -shell-escape -pdf -f %f "
          "latexmk -pdflatex='xelatex -shell-escape -interaction nonstopmode ' -shell-escape -pdf -f %f "))

#+end_src

*** Org Roam
***** Install package
#+NAME::org-roam-package
#+BEGIN_SRC emacs-lisp
  (require 'ucs-normalize)
  (use-package org-roam
    :straight (:host github :repo "org-roam/org-roam"
               :branch "main"
               :files (:defaults "extensions/*")
    :build (:not compile))
    :init
      (setq org-roam-v2-ack t) ;; Turn off v2 warning
      (setq org-roam-mode-section-functions
        (list #'org-roam-backlinks-section
              #'org-roam-reflinks-section
              #'org-roam-unlinked-references-section))
        (add-to-list 'display-buffer-alist
             '("\\*org-roam\\*"
               (display-buffer-in-direction)
               (direction . right)
               (window-width . 0.33)
               (window-height . fit-window-to-buffer)))
    :custom
      (org-roam-directory org-roam-directory-manual)
      (org-roam-dailies-directory "daily/")
      (org-roam-completion-everywhere t)
    :bind
      (("C-c r b" . org-roam-buffer-toggle)
       ("C-c r t" . org-roam-dailies-goto-today)
       ("C-c r y" . org-roam-dailies-goto-yesterday)
       ("C-M-n" . org-roam-node-insert)
         :map org-mode-map
       ("C-M-i"   . completion-at-point)
       ("C-M-f" . org-roam-node-find)
       ("C-M-c" . dl/org-roam-create-id)
       ("C-<left>" . org-roam-dailies-goto-previous-note)
       ("C-`" . org-roam-buffer-toggle)
       ("C-<right>" . org-roam-dailies-goto-next-note)))
  (org-roam-db-autosync-mode)
#+END_SRC

***** Configure templates
#+NAME::org-roam-templates
#+BEGIN_SRC emacs-lisp
(setq org-roam-dailies-capture-templates
  '(("d" "default" entry
     "* %?"
     :if-new (file+head "%<%Y-%m-%d>.org"
                        (lambda () (concat ":PROPERTIES:\n:ID:       " (org-id-new) "\n:END:\n"
                                           "#+TITLE: %<%Y-%m-%d>\n#+filetags: Daily \n" ; Added space here
                                           "* Log\n"))))))
#+END_SRC

***** Extending Roam
Here we add additional function to ~org-roam~ to either do something specific for more workflow, or otherwise make ~org-roam~ more full featured.

****** Set CREATED and LAST_MODIFIED filetags on save
Sets timestamps in the Properties drawer of files. I intend to use this one day when rendering these notes as HTML, to quickly see files last touched.

#+NAME::org-roam-set-timestamps-on-save
#+BEGIN_SRC emacs-lisp
  (defvar dl/org-created-property-name "CREATED")

  (defun dl/org-set-created-property (&optional active name)
    (interactive)
    (let* ((created (or name dl/org-created-property-name))
           (fmt (if active "<%s>" "[%s]"))
           (now (format fmt (format-time-string "%Y-%m-%d %a %H:%M"))))
      (unless (org-entry-get (point) created nil)
        (org-set-property created now)
        now)))

  (defun dl/org-find-time-file-property (property &optional anywhere)
    (save-excursion
      (goto-char (point-min))
      (let ((first-heading
             (save-excursion
               (re-search-forward org-outline-regexp-bol nil t))))
        (when (re-search-forward (format "^#\\+%s:" property)
                                 (if anywhere nil first-heading) t)
          (point)))))

  (defun dl/org-has-time-file-property-p (property &optional anywhere)
    (when-let ((pos (dl/org-find-time-file-property property anywhere)))
      (save-excursion
        (goto-char pos)
        (if (and (looking-at-p " ")
                 (progn (forward-char)
                        (org-at-timestamp-p 'lax)))
            pos -1))))

  (defun dl/org-set-time-file-property (property &optional anywhere pos)
    (when-let ((pos (or pos
                        (dl/org-find-time-file-property property))))
      (save-excursion
        (goto-char pos)
        (if (looking-at-p " ")
            (forward-char)
          (insert " "))
        (delete-region (point) (line-end-position))
        (let* ((now (format-time-string "[%Y-%m-%d %a %H:%M]")))
          (insert now)))))

  (defun dl/org-set-last-modified ()
    "Update the LAST_MODIFIED file property in the preamble."
    (when (derived-mode-p 'org-mode)
      (dl/org-set-time-file-property "LAST_MODIFIED")))
#+END_SRC

****** Set CREATED on node creation
#+NAME::org-roam-set-timestamps-on-save
#+BEGIN_SRC emacs-lisp
  (defun dl/org-roam-create-id ()
  "Add created date to org-roam node."
    (interactive)
    (org-id-get-create)
    (dl/org-set-created-property))
#+END_SRC

